model.h File Reference
Interfaces for SUModelRef for live access. More...
#include <SketchUpAPI/common.h>
 #include <SketchUpAPI/application/overlay.h>
Detailed Description
Interfaces for SUModelRef for live access.