attribute_dictionary.h File Reference
Interfaces for SUAttributeDictionaryRef. More...
#include <SketchUpAPI/common.h>
 #include <SketchUpAPI/unicodestring.h>
 #include <SketchUpAPI/model/defs.h>
 #include <SketchUpAPI/model/typed_value.h>
Detailed Description
Interfaces for SUAttributeDictionaryRef.