axes.h File Reference
Interfaces for SUAxesRef. More...
#include <SketchUpAPI/common.h>
 #include <SketchUpAPI/geometry.h>
 #include <SketchUpAPI/transformation.h>
 #include <SketchUpAPI/model/defs.h>
Detailed Description
Interfaces for SUAxesRef.