camera.h File Reference
Interfaces for SUCameraRef. More...
#include <SketchUpAPI/geometry.h>
 #include <SketchUpAPI/common.h>
 #include <SketchUpAPI/unicodestring.h>
 #include <SketchUpAPI/model/defs.h>
Detailed Description
Interfaces for SUCameraRef.