classification_info.h File Reference
Interfaces for SUClassificationInfoRef. More...
#include <SketchUpAPI/common.h>
 #include <SketchUpAPI/unicodestring.h>
 #include <SketchUpAPI/model/defs.h>
Detailed Description
Interfaces for SUClassificationInfoRef.