classification_attribute.h File Reference
Interfaces for SUClassificationAttributeRef. More...
#include <SketchUpAPI/common.h>
 #include <SketchUpAPI/unicodestring.h>
 #include <SketchUpAPI/model/defs.h>
Detailed Description
Interfaces for SUClassificationAttributeRef.