classifications.h File Reference
Interfaces for SUClassificationsRef. More...
#include <SketchUpAPI/common.h>
 #include <SketchUpAPI/model/defs.h>
Detailed Description
Interfaces for SUClassificationsRef.