component_instance.h File Reference
Interfaces for SUComponentInstanceRef. More...
#include <SketchUpAPI/common.h>
 #include <SketchUpAPI/unicodestring.h>
 #include <SketchUpAPI/transformation.h>
 #include <SketchUpAPI/model/defs.h>
Detailed Description
Interfaces for SUComponentInstanceRef.