Data Structures | Enumerations
component_definition.h File Reference
Interfaces for SUComponentDefinitionRef. More...
#include <SketchUpAPI/geometry.h>
 #include <SketchUpAPI/common.h>
 #include <SketchUpAPI/unicodestring.h>
 #include <SketchUpAPI/model/curve.h>
 #include <SketchUpAPI/model/defs.h>
 #include <SketchUpAPI/model/model_version.h>
 #include <time.h>
 #include <SketchUpAPI/model/component_definition_snap_to_behavior_private.h>
 Data Structures
struct  | SUComponentBehavior
Describes how the component behaves in a SketchUp model, e.g. how it glues to surfaces. More...
 Enumerations
enum  | SUComponentType { SUComponentType_Normal, SUComponentType_Group, SUComponentType_Image }
Indicates the type of the component. More...
Detailed Description
Interfaces for SUComponentDefinitionRef.
Enumeration Type Documentation
 enum SUComponentType
Indicates the type of the component.
Enumerator
SUComponentType_Normal
Regular component definition.
SUComponentType_Group
Group definition.
SUComponentType_Image
Image definition. (Added SketchUp 2022, API 10.0)