Enumerations
curve.h File Reference
Interfaces for SUCurveRef. More...
#include <SketchUpAPI/common.h>
 #include <SketchUpAPI/model/defs.h>
 Enumerations
enum  | SUCurveType { SUCurveType_Simple, SUCurveType_Arc }
Defines curve types that can be represented by SUCurveRef.
Detailed Description
Interfaces for SUCurveRef.