Data Structures
defs.h File Reference
General types for the API. More...
#include <SketchUpAPI/common.h>
 Data Structures
struct  | SULengthFormatterRef
References a length formatter object. Length formatters are used to generate formatted strings (optionally with units) from length, area, and volume values. Additionally length formatters can be used to translate a formatted length/area/volume string into a value. Accessors and setters are exposed for some of the key formatting properties, facilitating customization of the formater. In cases when users want the formatter to reflect the properties of a model, SUModelGetLengthFormatter should be used to more efficiently extract/copy the relevant properties from the model to the formatter. More...
struct  | SUStringRef
Stores a Unicode string for use as output string parameters in the API. More...
Detailed Description
General types for the API.