dimension_style.h File Reference
Interfaces for SUDimensionStyleRef. More...
#include <SketchUpAPI/color.h>
 #include <SketchUpAPI/model/defs.h>
 #include <SketchUpAPI/model/dimension.h>
Detailed Description
Interfaces for SUDimensionStyleRef.