Enumerations
dimension_linear.h File Reference
Interfaces for SUDimensionLinearRef. More...
#include <SketchUpAPI/geometry.h>
 #include <SketchUpAPI/model/defs.h>
 Enumerations
enum  | SUHorizontalTextPositionType { SUHorizontalTextPositionCenter, SUHorizontalTextPositionOutsideStart, SUHorizontalTextPositionOutsideEnd }
Indicates the different supported horizontal text position types. More...
enum  | SUVerticalTextPositionType { SUVerticalTextPositionCenter, SUVerticalTextPositionAbove, SUVerticalTextPositionBelow }
Indicates the different supported horizontal text position types. More...
enum  | SUDimensionLinearAlignmentType { SUDimensionLinearAlignmentAligned, SUDimensionLinearAlignmentVertical, SUDimensionLinearAlignmentHorizontal }
Indicates the different supported horizontal text position types. More...
Detailed Description
Interfaces for SUDimensionLinearRef.
Enumeration Type Documentation
 enum SUDimensionLinearAlignmentType
Indicates the different supported horizontal text position types.
Since
SketchUp 2019, API 7.0
 enum SUHorizontalTextPositionType
Indicates the different supported horizontal text position types.
Since
SketchUp 2017, API 5.0
 enum SUVerticalTextPositionType
Indicates the different supported horizontal text position types.
Since
SketchUp 2017, API 5.0