Enumerations
dimension.h File Reference
Interfaces for SUDimensionRef. More...
#include <SketchUpAPI/color.h>
 #include <SketchUpAPI/geometry.h>
 #include <SketchUpAPI/unicodestring.h>
 #include <SketchUpAPI/model/defs.h>
 #include <SketchUpAPI/model/arrow_type.h>
 Enumerations
enum  | SUDimensionType { SUDimensionType_Invalid, SUDimensionType_Linear, SUDimensionType_Radial }
Indicates the supported dimension types.
Detailed Description
Interfaces for SUDimensionRef.