drawing_element.h File Reference
Interfaces for SUDrawingElementRef. More...
#include <SketchUpAPI/common.h>
 #include <SketchUpAPI/model/defs.h>
Detailed Description
Interfaces for SUDrawingElementRef.