edge.h File Reference
Interfaces for SUEdgeRef. More...
#include <SketchUpAPI/color.h>
 #include <SketchUpAPI/common.h>
 #include <SketchUpAPI/geometry.h>
 #include <SketchUpAPI/unicodestring.h>
 #include <SketchUpAPI/transformation.h>
 #include <SketchUpAPI/model/defs.h>
Detailed Description
Interfaces for SUEdgeRef.