Data Structures
entities.h File Reference
Interfaces for SUEntitiesRef. More...
#include <SketchUpAPI/geometry.h>
 #include <SketchUpAPI/common.h>
 #include <SketchUpAPI/unicodestring.h>
 #include <SketchUpAPI/model/curve.h>
 #include <SketchUpAPI/model/defs.h>
 Data Structures
struct  | SUEntitiesParent
Reference to the parent of an SUEntitiesRef object. More...
Detailed Description
Interfaces for SUEntitiesRef.