Data Structures | Enumerations
extension_license.h File Reference
Interfaces for SUExtensionLicense. More...
#include <SketchUpAPI/common.h>
 Data Structures
struct  | SUExtensionLicense
Stores extension license information. More...
 Enumerations
enum  | SUExtensionLicenseState {
 SUExtensionLicenseState_Licensed, SUExtensionLicenseState_Expired, SUExtensionLicenseState_Trial, SUExtensionLicenseState_TrialExpired,
 SUExtensionLicenseState_NotLicensed
 }
Indicates the current state of an extension license. More...
Detailed Description
Interfaces for SUExtensionLicense.
Enumeration Type Documentation
 enum SUExtensionLicenseState
Indicates the current state of an extension license.
Enumerator
SUExtensionLicenseState_Licensed
Extension is licensed to run.
SUExtensionLicenseState_Expired
License had an expiration date and it expired.
SUExtensionLicenseState_Trial
Extension is in trial.
SUExtensionLicenseState_TrialExpired
Trial period has ended.
SUExtensionLicenseState_NotLicensed
Extension is not licensed.