face.h File Reference
Interfaces for SUFaceRef. More...
#include <SketchUpAPI/common.h>
 #include <SketchUpAPI/geometry.h>
 #include <SketchUpAPI/transformation.h>
 #include <SketchUpAPI/model/geometry_input.h>
 #include <SketchUpAPI/model/defs.h>
Detailed Description
Interfaces for SUFaceRef.