Data Structures
geometry_input.h File Reference
Interfaces for SUGeometryInputRef. More...
#include <SketchUpAPI/geometry.h>
 #include <SketchUpAPI/common.h>
 #include <SketchUpAPI/model/defs.h>
 #include <SketchUpAPI/model/curve.h>
 Data Structures
struct  | SUMaterialInput
SUMaterialInput contains information that is needed to apply a material to a face. More...
struct  | SUMaterialPositionInput
SUMaterialInput contains information that is needed to apply a material to a face. More...
Detailed Description
Interfaces for SUGeometryInputRef.