Data Structures
geometry.h File Reference
Define types for geometric operations. More...
#include <SketchUpAPI/common.h>
 Data Structures
struct  | SUPoint2D
Represents a point in 2-dimensional space. The coordinates are represented in inches. More...
struct  | SUVector2D
Represents a vector in 2-dimensional space. The magnitudes are represented in inches. More...
struct  | SUPoint3D
Represents a point in 3-dimensional space. The coordinates are represented in inches. More...
struct  | SUVector3D
Represents a vector in 3-dimensional space. The magnitudes are represented in inches. More...
struct  | SUPlane3D
Represents a 3D plane by the parameters a, b, c, d. For any point on the plane, ax + by + cz + d = 0. The coeficients are normalized so that a*a + b*b + c*c = 1. More...
struct  | SUBoundingBox3D
Represents a 3D axis-aligned bounding box represented by the extreme diagonal corner points with minimum and maximum x,y,z coordinates. The coordinates of the points are in inches. More...
struct  | SUAxisAlignedRect2D
Represents a 2D rectangle that is aligned with the X and Y axis of the coordinate system. The coordinates of the points of the rectangle are in inches. More...
struct  | SURay3D
Represents a 3D ray defined by a point and normal vector. The coordinates of the point are represented in inches. More...
struct  | SUTransformation
Represents a 3D (4x4) geometric transformation matrix. More...
struct  | SUTransformation2D
Represents a 2D (2x3) affine transformation matrix. The matrix is stored in column-major format: More...
Detailed Description
Define types for geometric operations.