group.h File Reference
Interfaces for SUGroupRef. More...
#include <SketchUpAPI/common.h>
 #include <SketchUpAPI/unicodestring.h>
 #include <SketchUpAPI/transformation.h>
 #include <SketchUpAPI/model/defs.h>
Detailed Description
Interfaces for SUGroupRef.