guide_point.h File Reference
Interfaces for SUGuidePointRef. More...
#include <SketchUpAPI/common.h>
 #include <SketchUpAPI/geometry.h>
 #include <SketchUpAPI/model/defs.h>
Detailed Description
Interfaces for SUGuidePointRef.