guide_line.h File Reference
Interfaces for SUGuideLineRef. More...
#include <SketchUpAPI/common.h>
 #include <SketchUpAPI/geometry.h>
 #include <SketchUpAPI/model/defs.h>
Detailed Description
Interfaces for SUGuideLineRef.