Data Structures
image_rep.h File Reference
Interfaces for SUImageRepRef. More...
#include <SketchUpAPI/color.h>
 #include <SketchUpAPI/model/defs.h>
 Data Structures
struct  | SUColorOrder
A simple struct with four indices indicating the ordering of color data within 32-bit bitmap images. 32-bit bitmap images have 4 channels per pixel: red, green, blue, and alpha where the alpha channel indicates the transparency of the pixel. SketchUpAPI expects the channels to be in different orders on Windows vs. Mac OS. Bitmap data is exposed in BGRA and RGBA byte orders on Windows and Mac OS, respectively. The color order indices facilitate platform independent code when it is necessary to manipulate image pixel data. The struct's data also applies to 24-bit bitmap images except that such images don't have an alpha channel so the SUColorOrder::alpha_index varaible can be ignored. More...
Detailed Description
Interfaces for SUImageRepRef.