Functions
initialize.h File Reference
Functionality for the API interface itself. More...
#include <SketchUpAPI/common.h>
 Functions
void  | SUInitialize ()
Initializes the slapi interface. Must be called before calling any other API function. More...
void  | SUTerminate ()
Signals termination of use of the slapi interface. Must be called when done using API functions. More...
void  | SUGetAPIVersion (size_t *major, size_t *minor)
Returns the major and minor API version numbers. More...
Detailed Description
Functionality for the API interface itself.
Function Documentation
 void SUGetAPIVersion  |  ( |  size_t *  |  major,
|  size_t *  |  minor
)
Returns the major and minor API version numbers.
Parameters
[out] | major | The major version number retrieved.
[out] | minor | The minor version number retrieved.
Note
This function hasn't reliably reported the correct versions prior to version 8.2 of the SDK.
 void SUInitialize  |  ( |   | )
Initializes the slapi interface. Must be called before calling any other API function.
Attention
This function should not be used from the Live API.
 void SUTerminate  |  ( |   | )
Signals termination of use of the slapi interface. Must be called when done using API functions.
Attention
This function should not be used from the Live API.