Enumerations
layer.h File Reference
Interfaces for SULayerRef. More...
#include <SketchUpAPI/common.h>
 #include <SketchUpAPI/unicodestring.h>
 #include <SketchUpAPI/model/defs.h>
 Enumerations
enum  | SULayerVisibilityDefaultType { SULayerVisibilityDefaultType_Visible, SULayerVisibilityDefaultType_Hidden }
Indicates whether to set the layer visible by default. Used for SULayerGetSceneBehavior() and SULayerSetSceneBehavior().
enum  | SULayerVisibilityNewSceneType { SULayerVisibilityNewSceneType_LayerDefault, SULayerVisibilityNewSceneType_Visible, SULayerVisibilityNewSceneType_Hidden }
Indicates whether to set the layer visible on new scenes. Used for SULayerGetSceneBehavior() and SULayerSetSceneBehavior().
Detailed Description
Interfaces for SULayerRef.