layer_folder.h File Reference
Interfaces for SULayerFolderRef. More...
#include <SketchUpAPI/common.h>
 #include <SketchUpAPI/unicodestring.h>
 #include <SketchUpAPI/model/defs.h>
Detailed Description
Interfaces for SULayerFolderRef.