Enumerations
loop.h File Reference
Interfaces for SULoopRef. More...
#include <SketchUpAPI/common.h>
 #include <SketchUpAPI/model/defs.h>
 Enumerations
enum  | SULoopWinding { SULoopWinding_CCW, SULoopWinding_CW }
Indicates loop orientation.
Detailed Description
Interfaces for SULoopRef.