Enumerations
material.h File Reference
Interfaces for SUMaterialRef. More...
#include <SketchUpAPI/color.h>
 #include <SketchUpAPI/common.h>
 #include <SketchUpAPI/unicodestring.h>
 #include <SketchUpAPI/model/defs.h>
 Enumerations
enum  | SUMaterialType { SUMaterialType_Colored, SUMaterialType_Textured, SUMaterialType_ColorizedTexture }
Indicates material type. More...
enum  | SUMaterialOwnerType { SUMaterialOwnerType_None, SUMaterialOwnerType_DrawingElement, SUMaterialOwnerType_Image, SUMaterialOwnerType_Layer }
Indicates material owner type. More...
enum  | SUMaterialColorizeType { SUMaterialColorizeType_Shift, SUMaterialColorizeType_Tint }
Indicates material type. More...
enum  | SUMaterialWorkflow { SUMaterialWorkflow_Classic, SUMaterialWorkflow_PBRMetallicRoughness }
Indicates the workflow being used to represent materials. More...
enum  | SUMaterialNormalMapStyle { SUMaterialNormalMapStyle_OpenGL, SUMaterialNormalMapStyle_DirectX }
Indicates the normal mapping convention used by the material. More...
Detailed Description
Interfaces for SUMaterialRef.
Enumeration Type Documentation
 enum SUMaterialColorizeType
Indicates material type.
Since
SketchUp 2019.2, API 7.1
Enumerator
SUMaterialColorizeType_Shift
Shifts the texture's Hue.
SUMaterialColorizeType_Tint
Colorize the texture.
 enum SUMaterialNormalMapStyle
Indicates the normal mapping convention used by the material.
Since
SketchUp 2025.0, API 13.0
Enumerator
SUMaterialNormalMapStyle_OpenGL
OpenGL style.
SUMaterialNormalMapStyle_DirectX
DirectX style.
 enum SUMaterialOwnerType
Indicates material owner type.
Since
SketchUp 2019.2, API 7.1
Enumerator
SUMaterialOwnerType_None
Not owned.
SUMaterialOwnerType_DrawingElement
Can be applied to SUDrawingElements.
SUMaterialOwnerType_Image
Owned exclusively by an Image.
SUMaterialOwnerType_Layer
Owned exclusively by a Layer.
 enum SUMaterialType
Indicates material type.
Enumerator
SUMaterialType_Colored
Colored material.
SUMaterialType_Textured
Textured material.
SUMaterialType_ColorizedTexture
Colored and textured material.
 enum SUMaterialWorkflow
Indicates the workflow being used to represent materials.
Since
SketchUp 2025.0, API 13.0
Enumerator
SUMaterialWorkflow_Classic
Classic material workflow.
SUMaterialWorkflow_PBRMetallicRoughness
PBR metallic/roughness material workflow.