mesh_helper.h File Reference
Interfaces for SUMeshHelperRef. More...
#include <stdlib.h>
 #include <SketchUpAPI/geometry.h>
 #include <SketchUpAPI/common.h>
 #include <SketchUpAPI/model/defs.h>
 #include <SketchUpAPI/model/texture_writer.h>
Detailed Description
Interfaces for SUMeshHelperRef.