Data Structures | Enumerations
defs.h File Reference
Types related to the SketchUp model. More...
#include <SketchUpAPI/defs.h>
 Data Structures
struct  | SUArcCurveRef
References an arccurve. More...
struct  | SUAttributeDictionaryRef
A dictionary type with SUStringRef objects as keys and SUTypedValueRef objects as values. More...
struct  | SUAxesRef
An axes entity reference. More...
struct  | SUCameraRef
References the camera object of a SketchUp model. More...
struct  | SUClassificationsRef
Used to manage a Classifications object. More...
struct  | SUClassificationAttributeRef
References attribute data about a classified component. More...
struct  | SUClassificationInfoRef
References an object with classification information. Each SUClassificationInfoRef contains the names of the schemas and the schema types, and the types attributes. See SUClassificationAttributeRef for details on the type attributes. More...
struct  | SUComponentDefinitionRef
References a component definition. More...
struct  | SUComponentInstanceRef
References a component instance, i.e. an instance of a component definition. More...
struct  | SUCurveRef
References a curve. More...
struct  | SUDimensionRef
A dimension entity reference. More...
struct  | SUDimensionLinearRef
A linear dimension entity reference. More...
struct  | SUDimensionRadialRef
A radial dimension entity reference. More...
struct  | SUDimensionStyleRef
A dimension style reference. More...
struct  | SUDrawingElementRef
References a drawing element, which is an abstract base type for some API types. More...
struct  | SUDynamicComponentInfoRef
References an object with information about a dynamic component. More...
struct  | SUDynamicComponentAttributeRef
References attribute data about a dynamic component. More...
struct  | SUEdgeRef
References an edge. More...
struct  | SUEdgeUseRef
SUEdgeUseRef objects are used to retrieve the topology of the edges of a polygon. The geometry of the polygon being represented by SULoopRef that is already associated with a face object. The typical use of EdgeUse object is to retrieve them from a face object's loop, and then read the topology values from them. More...
struct  | SUEntitiesRef
References a container object for all entities in a model, component definition or a group. More...
struct  | SUEntityListRef
References an entity list. More...
struct  | SUEntityListIteratorRef
References an entity list iterator object. More...
struct  | SUEntityRef
References an entity, which is an abstract base type for most API types. More...
struct  | SUEnvironmentRef
References an environment, which enables sky boxes and image-based lighting. More...
struct  | SUEnvironmentsRef
References a container object for all environments in a model. More...
struct  | SUFaceRef
References a face. More...
struct  | SUFontRef
A font entity reference. More...
struct  | SUGeometryInputRef
References a geometry input object. It is used as an input to SUEntitiesFill(). More...
struct  | SUGroupRef
References a group object. More...
struct  | SUGuideLineRef
A guide line that has a start and end position. More...
struct  | SUGuidePointRef
A guide point that has a position. More...
struct  | SUImageRef
References an image object. More...
struct  | SUImageRepRef
References an image representation object. More...
struct  | SUInstancePathRef
An instance path type that provides a wrapping of a data structure of component instances. More...
struct  | SULayerRef
References a Tag object. More...
struct  | SULayerFolderRef
References a Tag Folder object. More...
struct  | SULineStyleRef
References a line style. More...
struct  | SULineStylesRef
Provides access to the different line style objects in the model. More...
struct  | SULocationRef
References a type that contains location information of a model (e.g. latitude, longitude). More...
struct  | SULoopInputRef
struct  | SULoopRef
References a loop object, which can be either the outer loop or an inner loop (hole) of a face. More...
struct  | SUMaterialRef
References a material object. More...
struct  | SUMeshHelperRef
A helper class that will tessellate a SUFaceRef object into triangles, and then provide the vertices, normals, and STQ coordinates of those triangles. More...
struct  | SUModelRef
A SketchUp model. More...
struct  | SUOpeningRef
References an opening object, which is a hole in a face created by an attached component instance or group. More...
struct  | SUOptionsManagerRef
Provides access to the different options provider objects in the model. Available options providers are: PageOptions, SlideshowOptions, UnitsOptions and PrintOptions. More...
struct  | SUOptionsProviderRef
Provides ability to get and set options on an options provider object. Available options providers are: PageOptions, SlideshowOptions, UnitsOptions and PrintOptions. More...
struct  | SUOverlayRef
Manages a Overlay object, which is used to blend external images on top of SketchUp rendering. More...
struct  | SUPolyline3dRef
A polyline3d object. These are curve-like entities that do not generate inference snaps or affect geometry in any way. More...
struct  | SURenderingOptionsRef
Used to get and set values in a rendering options object. More...
struct  | SUSceneRef
Used to get and set a scene's camera views, using the SUCameraRef object. More...
struct  | SUSchemaRef
Used to manage a Schema object. More...
struct  | SUSchemaTypeRef
Used to manage a SchemaType object. More...
struct  | SUSectionPlaneRef
A sectionPlane entity reference. More...
struct  | SUSelectionRef
References a the model selection. This is only available from within the SketchUp application. More...
struct  | SUShadowInfoRef
Used to get and set values in a shadow info object. More...
struct  | SUSnapRef
References a snap. More...
struct  | SUStyleRef
A style entity reference. More...
struct  | SUStylesRef
A styles entity reference. More...
struct  | SUTextRef
A text entity reference. More...
struct  | SUTextureRef
Used to manage image data that can be associated with any SUEntityRef. More...
struct  | SUTextureWriterRef
Used to write out textures of various SketchUp model elements to local disk. For face objects texture writer modifies non-affine textures on write so that the resulting texture image can be mapped with 2-dimensional texture coordinates. The modified UV coordinates are retrieved from a mesh object created with SUMeshHelperCreateWithTextureWriter(). More...
struct  | SUTypedValueRef
Variant object used to represent the value of a key-value attribute pair. More...
struct  | SUUVHelperRef
Used to compute UV texture coordinates for a particular face. More...
struct  | SUVertexRef
A vertex type that has a position and is associated with other geometry like edges, faces, and loops. More...
 Enumerations
enum  | SURefType {
 SURefType_Unknown, SURefType_AttributeDictionary, SURefType_Camera, SURefType_ComponentDefinition,
 SURefType_ComponentInstance, SURefType_Curve, SURefType_Edge, SURefType_EdgeUse,
 SURefType_Environment, SURefType_Environments, SURefType_Entities, SURefType_Face,
 SURefType_Group, SURefType_Image, SURefType_Layer, SURefType_Location,
 SURefType_Loop, SURefType_MeshHelper, SURefType_Material, SURefType_Model,
 SURefType_Polyline3D, SURefType_Scene, SURefType_Texture, SURefType_TextureWriter,
 SURefType_TypedValue, SURefType_UVHelper, SURefType_Vertex, SURefType_RenderingOptions,
 SURefType_GuidePoint, SURefType_GuideLine, SURefType_Schema, SURefType_SchemaType,
 SURefType_ShadowInfo, SURefType_Axes, SURefType_ArcCurve, SURefType_SectionPlane,
 SURefType_DynamicComponentInfo, SURefType_DynamicComponentAttribute, SURefType_Style, SURefType_Styles,
 SURefType_ImageRep, SURefType_InstancePath, SURefType_Font, SURefType_Dimension,
 SURefType_DimensionLinear, SURefType_DimensionRadial, SURefType_DimensionStyle, SURefType_Text,
 SURefType_EntityList, SURefType_EntityListIterator, SURefType_DrawingElement, SURefType_Entity,
 SURefType_LengthFormatter, SURefType_LineStyle, SURefType_LineStyleManager, SURefType_Selection,
 SURefType_LayerFolder, SURefType_Snap
 }
Types of concrete object references. More...
Detailed Description
Types related to the SketchUp model.
Enumeration Type Documentation
 enum SURefType
Types of concrete object references.
Enumerator
SURefType_Unknown
Unknown object type.
SURefType_AttributeDictionary
SUAttributeDictionaryRef type.
SURefType_Camera
SUCameraRef type.
SURefType_ComponentDefinition
SUComponentDefinitionRef type.
SURefType_ComponentInstance
SUComponentInstanceRef type.
SURefType_Curve
SUCurveRef type.
SURefType_Edge
SUEdgeRef type.
SURefType_EdgeUse
SUEdgeUseRef type.
SURefType_Environment
SUEnvironment type.
SURefType_Environments
SUEnvironments type.
SURefType_Entities
SUEntitiesRef type.
SURefType_Face
SUFaceRef type.
SURefType_Group
SUGroupRef type.
SURefType_Image
SUImageRef type.
SURefType_Layer
SULayerRef type.
SURefType_Location
SULocationRef type.
SURefType_Loop
SULoopRef type.
SURefType_MeshHelper
SUMeshHelperRef type.
SURefType_Material
SUMaterialRef type.
SURefType_Model
SUModelRef type.
SURefType_Polyline3D
SUPolyline3DRef type.
SURefType_Scene
SUSceneRef type.
SURefType_Texture
SUTextureRef type.
SURefType_TextureWriter
SUTextureWriterRef type.
SURefType_TypedValue
SUTypedValueRef type.
SURefType_UVHelper
SUUVHelperRef type.
SURefType_Vertex
SUVertexRef type.
SURefType_RenderingOptions
SURenderingOptionsRef type.
SURefType_GuidePoint
SUGuidePointRef type.
SURefType_GuideLine
SUGuideLineRef type.
SURefType_Schema
SUSchemaRef type.
SURefType_SchemaType
SUSchemaTypeRef type.
SURefType_ShadowInfo
SUShadowInfoRef type.
SURefType_Axes
SUAxesRef type.
SURefType_ArcCurve
SUArcCurveRef type.
SURefType_SectionPlane
SUSectionPlaneRef type.
SURefType_DynamicComponentInfo
SUDynamicComponentInfoRef type.
SURefType_DynamicComponentAttribute
SUDynamicComponentAttributeRef type.
SURefType_Style
SUStyleRef type.
SURefType_Styles
SUStylesRef type.
SURefType_ImageRep
SUImageRepRef type.
SURefType_InstancePath
SUInstancePathRef type.
SURefType_Font
SUFontRef type.
SURefType_Dimension
SUDimensionRef type.
SURefType_DimensionLinear
SUDimensionLinearRef type.
SURefType_DimensionRadial
SUDimensionRadialRef type.
SURefType_DimensionStyle
SUDimensionStyleRef type.
SURefType_Text
SUTextRef type.
SURefType_EntityList
SUEntityListRef type.
SURefType_EntityListIterator
SUEntityListIteratorRef type.
SURefType_DrawingElement
SUDrawingElementRef type.
SURefType_Entity
SUEntityRef type.
SURefType_LengthFormatter
SULengthFormatterRef type.
SURefType_LineStyle
SULineStyleRef type.
SURefType_LineStyleManager
SULineStyleManagerRef type.
SURefType_Selection
SUSelectionRef type.
SURefType_LayerFolder
SULayerFolderRef type.
SURefType_Snap
SUSnapRef type.