Data Structures | Enumerations
model.h File Reference
Interfaces for SUModelRef. More...
#include <SketchUpAPI/common.h>
 #include <SketchUpAPI/unicodestring.h>
 #include <SketchUpAPI/model/defs.h>
 #include <SketchUpAPI/model/model_version.h>
 #include <SketchUpAPI/model/model_entity_type_private.h>
 Data Structures
struct  | SUModelStatistics
Contains an array of entity counts that can be indexed per entity type. More...
struct  | SUFontInfo
Information about the font that is to be created by SUModelAddFont. More...
 Macros
Entity Type Flags
Flags for SUModelGetEntitiesOfTypeByPersistentIDs(). These can be combined bitwise.
Since
SketchUp 2020.2, API 8.2
See Also
SUModelRef
 #define  | FLAG_GET_ENTITIES_TYPE_DEFINITION_ENTITIES
Any entities inside the root or another definition's entities.
 #define  | FLAG_GET_ENTITIES_TYPE_LAYERS
SULayerRef entities.
 #define  | FLAG_GET_ENTITIES_TYPE_LAYER_FOLDERS
SULayerFolderRef entities.
 #define  | FLAG_GET_ENTITIES_TYPE_MATERIALS
SUMaterialRef entities.
 #define  | FLAG_GET_ENTITIES_TYPE_SCENES
SUSceneRef entities.
 #define  | FLAG_GET_ENTITIES_TYPE_STYLES
SUStyleRef entities.
 #define  | FLAG_GET_ENTITIES_TYPE_DEFINITIONS
SUComponentDefinitionRef entities.
 #define  | FLAG_GET_ENTITIES_TYPE_ALL
Search all types.
 Enumerations
enum  | SUModelUnits {
 SUModelUnits_Inches, SUModelUnits_Feet, SUModelUnits_Millimeters, SUModelUnits_Centimeters,
 SUModelUnits_Meters
 }
Units options settings.
enum  | SUModelLoadStatus { SUModelLoadStatus_Success, SUModelLoadStatus_Success_MoreRecent }
Provides additional status information after loading a model successfully. More...
Detailed Description
Interfaces for SUModelRef.
Enumeration Type Documentation
 enum SUModelLoadStatus
Provides additional status information after loading a model successfully.
Since
SketchUp 2021, API 9.0
Enumerator
SUModelLoadStatus_Success
Model was loaded successfully.
SUModelLoadStatus_Success_MoreRecent
Model was loaded successfully, however it was saved by a newer version of SketchUp. We strongly recommended that you update your SDK to the latest version.