opening.h File Reference
Interfaces for SUOpeningRef. More...
#include <SketchUpAPI/common.h>
 #include <SketchUpAPI/geometry.h>
 #include <SketchUpAPI/model/defs.h>
 #include <SketchUpAPI/model/component_instance.h>
Detailed Description
Interfaces for SUOpeningRef.