options_provider.h File Reference
Interfaces for SUOptionsProviderRef. More...
#include <SketchUpAPI/common.h>
 #include <SketchUpAPI/unicodestring.h>
 #include <SketchUpAPI/model/defs.h>
Detailed Description
Interfaces for SUOptionsProviderRef.