options_manager.h File Reference
Interfaces for SUOptionsManagerRef. More...
#include <SketchUpAPI/common.h>
 #include <SketchUpAPI/unicodestring.h>
 #include <SketchUpAPI/model/defs.h>
Detailed Description
Interfaces for SUOptionsManagerRef.