rendering_options.h File Reference
Interfaces for SURenderingOptionsRef. More...
#include <SketchUpAPI/color.h>
 #include <SketchUpAPI/common.h>
 #include <SketchUpAPI/unicodestring.h>
 #include <SketchUpAPI/model/defs.h>
Detailed Description
Interfaces for SURenderingOptionsRef.