scene.h File Reference
Interfaces for SUSceneRef. More...
#include <SketchUpAPI/common.h>
 #include <SketchUpAPI/unicodestring.h>
 #include <SketchUpAPI/model/defs.h>
 Macros
Scene Flags
Flags for SUSceneGetFlags() and SUSceneSetFlags(). These are combined bitwise.
See Also
SUSceneRef
#define  | FLAG_USE_CAMERA
#define  | FLAG_USE_RENDERING_OPTIONS
#define  | FLAG_USE_SHADOWINFO
#define  | FLAG_USE_AXES
#define  | FLAG_USE_HIDDEN
#define  | FLAG_USE_LAYER_VISIBILITY
#define  | FLAG_USE_SECTION_PLANES
#define  | FLAG_USE_HIDDEN_GEOMETRY
#define  | FLAG_USE_HIDDEN_OBJECTS
#define  | FLAG_USE_ENVIRONMENT
#define  | FLAG_USE_ALL
#define  | FLAG_NO_CAMERA
Detailed Description
Interfaces for SUSceneRef.
Macro Definition Documentation
 #define FLAG_NO_CAMERA
Since
SketchUp 2017, API 5.0
 #define FLAG_USE_ALL
Since
SketchUp 2017, API 5.0
 #define FLAG_USE_AXES
Since
SketchUp 2017, API 5.0
 #define FLAG_USE_CAMERA
Since
SketchUp 2017, API 5.0
 #define FLAG_USE_ENVIRONMENT
Since
SketchUp 2025.0, API 13.0
 #define FLAG_USE_HIDDEN
Deprecated:
Obsolete since SketchUp 2020.1, API 8.1. Instead, use FLAG_USE_HIDDEN_GEOMETRY and FLAG_USE_HIDDEN_OBJECTS.
Since
SketchUp 2017, API 5.0
 #define FLAG_USE_HIDDEN_GEOMETRY
Since
SketchUp 2020.1, API 8.1
 #define FLAG_USE_HIDDEN_OBJECTS
Since
SketchUp 2020.1, API 8.1
 #define FLAG_USE_LAYER_VISIBILITY
Since
SketchUp 2017, API 5.0
 #define FLAG_USE_RENDERING_OPTIONS
Since
SketchUp 2017, API 5.0
 #define FLAG_USE_SECTION_PLANES
Since
SketchUp 2017, API 5.0
 #define FLAG_USE_SHADOWINFO
Since
SketchUp 2017, API 5.0