Enumerations
selection.h File Reference
Interfaces for SUSelectionRef. More...
#include <SketchUpAPI/common.h>
 #include <SketchUpAPI/model/defs.h>
 Enumerations
enum  | SUSelectionType { SUSelectionType_Curve, SUSelectionType_Surface, SUSelectionType_SingleObject }
Used with SUSelectionIsType() to query for what type the selection is. More...
Detailed Description
Interfaces for SUSelectionRef.
Enumeration Type Documentation
 enum SUSelectionType
Used with SUSelectionIsType() to query for what type the selection is.
See Also
SUSelectionIsType()
Since
SketchUp 2020.2, API 8.2
Enumerator
SUSelectionType_Curve
Query for the selection to contain a single SUCurveRef or SUArcCurveRef.
SUSelectionType_Surface
Query for the selection containing only faces that belong to a single surface. SketchUp considers set of faces connected with soft+smooth edges to form a surface.
SUSelectionType_SingleObject
Query for a single SUDrawingElementRef being selected or satifying the conditions of SU_SELECTION_CURVE or SU_SELECTION_SURFACE.