shadow_info.h File Reference
Interfaces for SUShadowInfoRef. More...
#include <SketchUpAPI/common.h>
 #include <SketchUpAPI/unicodestring.h>
 #include <SketchUpAPI/model/defs.h>
Detailed Description
Interfaces for SUShadowInfoRef.