Functions
skp.h File Reference
Interfaces for reading metadata from SketchUp files without loading the whole file. More...
#include <SketchUpAPI/common.h>
 #include <SketchUpAPI/unicodestring.h>
 Functions
enum SUResult  | SUSkpReadGuid (const char *file_path, SUStringRef *guid)
Reads the GUID, globally unique identifier, for a model without opening the whole file. More...
Detailed Description
Interfaces for reading metadata from SketchUp files without loading the whole file.
Function Documentation
 enum SUResult SUSkpReadGuid  |  ( |  const char *  |  file_path,
|  SUStringRef *  |  guid
)
Reads the GUID, globally unique identifier, for a model without opening the whole file.
Since
SketchUp 2021.0, API 9.0
See Also
SUModelGetGuid
 SUComponentDefinitionGetGuid
Parameters
[in] | file_path | The model filepath to read from.
[out] | guid | The guid string.
Returns
SU_ERROR_NONE on success
SU_ERROR_NULL_POINTER_INPUT if file_path is NULL
SU_ERROR_INVALID_INPUT if file_path does not exist
SU_ERROR_NULL_POINTER_OUTPUT if guid is NULL
SU_ERROR_INVALID_OUTPUT if guid does not point to a valid SUStringRef object.
SU_ERROR_MODEL_INVALID if the model is not valid
SU_ERROR_GENERIC if an unknown error occured reading the file