space.h File Reference
Interfaces for SUSpaceRef. More...
#include <SketchUpAPI/common.h>
 #include <SketchUpAPI/geometry.h>
 #include <SketchUpAPI/model/defs.h>
Detailed Description
Interfaces for SUSpaceRef.
For internal use only at this time. APIs may change.