SUSchemaTypeRef Struct Reference
Used to manage a SchemaType object. More...
#include <SketchUpAPI/model/schema_type.h>
Detailed Description
Used to manage a SchemaType object.
The documentation for this struct was generated from the following file:
SketchUpAPI/model/defs.h