Data Fields
SUDrawFrameMemoryBuffer Struct Reference
Memory buffer (for color and depth) info used in SUOverlayDrawFrameInfo. More...
#include <SketchUpAPI/application/overlay.h>
 Data Fields
 void *  | ptr
Pointer to the buffer.
 uint32_t  | row_pitch
Size (in bytes) from the beginning of one line of the buffer to the next line.
 uint32_t  | size
Total size (in bytes) of the buffer.
Detailed Description
Memory buffer (for color and depth) info used in SUOverlayDrawFrameInfo.
The documentation for this struct was generated from the following file:
SketchUpAPI/application/overlay.h