Data Fields
SUFontInfo Struct Reference
Information about the font that is to be created by SUModelAddFont. More...
#include <SketchUpAPI/model/model.h>
 Data Fields
unsigned int  | version
const char *  | font_name
bool  | is_bold
bool  | is_italic
int  | point_size
bool  | use_world_size
double  | world_size
Detailed Description
Information about the font that is to be created by SUModelAddFont.
Since
SketchUp 2026.0, API 14.0
Field Documentation
 const char* SUFontInfo::font_name
Name of the font. Assumed to be UTF-8 encoded.
 bool SUFontInfo::is_bold
Boldness of the font (true for bold, false for normal).
 bool SUFontInfo::is_italic
Italic (true for italic, false for normal).
 int SUFontInfo::point_size
2D font size in screen points (when use_world_size is false).
 bool SUFontInfo::use_world_size
Which sizing style to use.
true: font size scales relative to in-model 3D objects.
false: font size stays constant on user's screen.
 unsigned int SUFontInfo::version
Version of the SUFontInfo struct. Must be set to SU_FONT_INFO_VERSION.
 double SUFontInfo::world_size
3D font size in inches (when use_world_size is true).
 The documentation for this struct was generated from the following file:
SketchUpAPI/model/model.h