Data Fields
SUBeginFrameInfo Struct Reference
Information about the frame camera and viewport that is passed to SUOverlayCreateInfo::begin_frame. More...
#include <SketchUpAPI/application/overlay.h>
 Data Fields
 enum SUOverlayBeginFrameInfoVersion  | version
Version of SUBeginFrameInfo struct. This will be set by SketchUp.
 struct SUPoint3D  | position
Camera position.
 struct SUPoint3D  | target
Camera target position.
 struct SUVector3D  | up
Camera up direction.
 double  | aspect_ratio
Aspect ratio of the view port.
 double  | near_clipping_distance
Distance to near clipping plane from the camera.
 double  | far_clipping_distance
Distance to far clipping plane from the camera.
 double  | projection_matrix [16]
Projection Matrix, stored in row major order.
 double  | view_matrix [16]
View Matrix, stored in row major order.
 double  | viewport_width
Viewport width.
 double  | viewport_height
Viewport height.
double  | fov
 double  | height
Parallel projection frustum height. Valid only when is_perspective is false.
 bool  | is_perspective
Whether the camera is perspective or orthographic.
void *  | reserved
Detailed Description
Information about the frame camera and viewport that is passed to SUOverlayCreateInfo::begin_frame.
Field Documentation
 double SUBeginFrameInfo::fov
Field of view of the perspective camera (in degrees). Valid only when is_perspective is true.
 void* SUBeginFrameInfo::reserved
Reserved for internal use. This will be set to NULL by SketchUp and should not be modified.
 The documentation for this struct was generated from the following file:
SketchUpAPI/application/overlay.h