Data Fields
SUAxisAlignedRect2D Struct Reference
Represents a 2D rectangle that is aligned with the X and Y axis of the coordinate system. The coordinates of the points of the rectangle are in inches. More...
#include <SketchUpAPI/geometry.h>
 Data Fields
 struct SUPoint2D  | upper_left
Upper left corner of the bounding box.
 struct SUPoint2D  | lower_right
Lower right corner of the bounding box.
Detailed Description
Represents a 2D rectangle that is aligned with the X and Y axis of the coordinate system. The coordinates of the points of the rectangle are in inches.
The documentation for this struct was generated from the following file:
SketchUpAPI/geometry.h