Data Fields
SUModelStatistics Struct Reference
Contains an array of entity counts that can be indexed per entity type. More...
#include <SketchUpAPI/model/model.h>
 Data Fields
 int  | entity_counts [SUNumEntityTypes]
Count of each entity type.
Detailed Description
Contains an array of entity counts that can be indexed per entity type.
Note
See SUEntityType for examples on how it is defined depending on whether the code is compiled as C or C++. (Related to a bug in the original implementation).
See Also
SUEntityType
 SUModelGetStatistics
The documentation for this struct was generated from the following file:
SketchUpAPI/model/model.h