Data Fields
SUEntitiesParent Struct Reference
Reference to the parent of an SUEntitiesRef object. More...
#include <SketchUpAPI/model/entities.h>
 Data Fields
 SUModelRef  | model
The parent model, or SU_INVALID if the parent is a component definition.
 SUComponentDefinitionRef  | definition
The parent component definition, or SU_INVALID if the parent is a model.
Detailed Description
Reference to the parent of an SUEntitiesRef object.
Since
SketchUp 2021.1, API 9.1
The documentation for this struct was generated from the following file:
SketchUpAPI/model/entities.h