Enumerations
style.h File Reference
Interfaces for SUStyleRef. More...
#include <SketchUpAPI/common.h>
 #include <SketchUpAPI/unicodestring.h>
 #include <SketchUpAPI/geometry.h>
 #include <SketchUpAPI/model/defs.h>
 Enumerations
enum  | SUStylePropertyType {
 SUStyleEdgesColor, SUStyleEdgesExtensionsEnabled, SUStyleEdgesExtensionLength, SUStyleEdgesProfilesEnabled,
 SUStyleEdgesProfileWidth, SUStyleEdgesDepthCueEnabled, SUStyleEdgesDepthCueLevels, SUStyleBackgroundColor
 }
The set style properties that can be set/retrieved. Each property supports a single data type indicated by comments in the list. More...
Detailed Description
Interfaces for SUStyleRef.
Enumeration Type Documentation
 enum SUStylePropertyType
The set style properties that can be set/retrieved. Each property supports a single data type indicated by comments in the list.
Enumerator
SUStyleEdgesColor
data type: SUTypedValueType_Color.
SUStyleEdgesExtensionsEnabled
data type: SUTypedValueType_Bool.
SUStyleEdgesExtensionLength
data type: SUTypedValueType_Int32.
SUStyleEdgesProfilesEnabled
data type: SUTypedValueType_Bool.
SUStyleEdgesProfileWidth
data type: SUTypedValueType_Int32.
SUStyleEdgesDepthCueEnabled
data type: SUTypedValueType_Bool.
SUStyleEdgesDepthCueLevels
data type: SUTypedValueType_Int32.
SUStyleBackgroundColor
data type: SUTypedValueType_Color.