styles.h File Reference
Interfaces for SUStylesRef. More...
#include <SketchUpAPI/common.h>
 #include <SketchUpAPI/geometry.h>
 #include <SketchUpAPI/model/defs.h>
Detailed Description
Interfaces for SUStylesRef.