texture.h File Reference
Interfaces for SUTextureRef. More...
#include <stddef.h>
 #include <SketchUpAPI/color.h>
 #include <SketchUpAPI/unicodestring.h>
 #include <SketchUpAPI/model/defs.h>
Detailed Description
Interfaces for SUTextureRef.