texture_writer.h File Reference
Interfaces for SUTextureWriterRef. More...
#include <SketchUpAPI/geometry.h>
 #include <SketchUpAPI/unicodestring.h>
 #include <SketchUpAPI/model/defs.h>
 #include <SketchUpAPI/model/face.h>
Detailed Description
Interfaces for SUTextureWriterRef.