Enumerations
text.h File Reference
Interfaces for SUTextRef. More...
#include <SketchUpAPI/color.h>
 #include <SketchUpAPI/unicodestring.h>
 #include <SketchUpAPI/geometry.h>
 #include <SketchUpAPI/model/defs.h>
 #include <SketchUpAPI/model/arrow_type.h>
 Enumerations
enum  | SUTextLeaderType { SUTextLeaderType_None, SUTextLeaderType_ViewBased, SUTextLeaderType_PushPin }
Indicates the supported leader line types.
Detailed Description
Interfaces for SUTextRef.