Enumerations
typed_value.h File Reference
Interfaces for SUTypedValueRef. More...
#include <SketchUpAPI/color.h>
 #include <SketchUpAPI/common.h>
 #include <SketchUpAPI/unicodestring.h>
 #include <SketchUpAPI/model/defs.h>
 Enumerations
enum  | SUTypedValueType {
 SUTypedValueType_Empty, SUTypedValueType_Byte, SUTypedValueType_Short, SUTypedValueType_Int32,
 SUTypedValueType_Float, SUTypedValueType_Double, SUTypedValueType_Bool, SUTypedValueType_Color,
 SUTypedValueType_Time, SUTypedValueType_String, SUTypedValueType_Vector3D, SUTypedValueType_Array
 }
The set of types that a SUTypedValueRef can represent. More...
Detailed Description
Interfaces for SUTypedValueRef.
Enumeration Type Documentation
 enum SUTypedValueType
The set of types that a SUTypedValueRef can represent.
Enumerator
SUTypedValueType_Empty
No value set.
SUTypedValueType_Byte
Byte value type.
SUTypedValueType_Short
Short value type.
SUTypedValueType_Int32
Int32 value type.
SUTypedValueType_Float
Float value type.
SUTypedValueType_Double
Double value type.
SUTypedValueType_Bool
Bool value type.
SUTypedValueType_Color
Color value type.
SUTypedValueType_Time
Time value type.
SUTypedValueType_String
String value type.
SUTypedValueType_Vector3D
Vector3D value type.
SUTypedValueType_Array
Array value type.