vertex.h File Reference
Interfaces for SUVertexRef. More...
#include <SketchUpAPI/common.h>
 #include <SketchUpAPI/geometry.h>
 #include <SketchUpAPI/model/defs.h>
Detailed Description
Interfaces for SUVertexRef.