Data Structures | Typedefs
geometry.h File Reference
#include <SketchUpAPI/geometry.h>
Go to the source code of this file.
 Data Structures
struct  | LOOrientedRect2D
Represents a 2D rectangle that might be rotated. Each corner of the rectangle is represented by a separate 2D point. More...
struct  | LORect2D
Represents a 2D rectangle. More...
 Typedefs
typedef SUPoint2D  | LOPoint2D
Represents a point in 2-dimensional paper space. More...
typedef SUPoint3D  | LOPoint3D
Represents a point in 3-dimensional model space. More...
typedef SUVector2D  | LOVector2D
Represents a vector in 2-dimensional paper space. More...
typedef SUAxisAlignedRect2D  | LOAxisAlignedRect2D
typedef SUTransformation2D  | LOTransformMatrix2D
typedef LOPoint2D  | LOSize2D
Typedef Documentation
 typedef SUAxisAlignedRect2D LOAxisAlignedRect2D
 LOPoint2D
Represents a point in 2-dimensional paper space.
Represents a size in 2D space.
 LOPoint3D
Represents a point in 3-dimensional model space.
 typedef LOPoint2D LOSize2D
 typedef SUTransformation2D LOTransformMatrix2D
 LOVector2D
Represents a vector in 2-dimensional paper space.
Since
LayOut 2017, API 2.0