Functions
application.h File Reference
Interfaces for usage within the SketchUp application. More...
#include <SketchUpAPI/common.h>
 #include <SketchUpAPI/model/defs.h>
Go to the source code of this file.
 Functions
SU_RESULT  | SUApplicationGetActiveModel (SUModelRef *model)
Gets a reference to the active model. The reference is owned by the SketchUp application and should not be released. More...
Detailed Description
Interfaces for usage within the SketchUp application.
Function Documentation
 SU_RESULT SUApplicationGetActiveModel  |  ( |  SUModelRef *  |  model | )
Gets a reference to the active model. The reference is owned by the SketchUp application and should not be released.
Since
SketchUp 2019.2, API 7.1
Parameters
[out] | model | The model object.
See Also
SUModelRef
Returns
SU_ERROR_NONE on success
SU_ERROR_NULL_POINTER_OUTPUT if model is NULL
SU_ERROR_NO_DATA if there is no active model