Enumerations
length_formatter.h File Reference
Interfaces for SULengthFormatterRef. More...
#include <SketchUpAPI/defs.h>
Go to the source code of this file.
 Enumerations
enum  | SULengthFormatType { SU_LFORMAT_DECIMAL, SU_LFORMAT_ARCHITECTURAL, SU_LFORMAT_ENGINEERING, SU_LFORMAT_FRACTIONAL }
Indicates the different supported length string formatting types. More...
enum  | SULengthUnitType {
 SU_LUNIT_INCHES, SU_LUNIT_FEET, SU_LUNIT_MILLIMETER, SU_LUNIT_CENTIMETER,
 SU_LUNIT_METER, SU_LUNIT_YARD
 }
Indicates the different supported length string formatting units. More...
enum  | SUAreaUnitType {
 SU_AUNIT_SQUARE_INCHES, SU_AUNIT_SQUARE_FEET, SU_AUNIT_SQUARE_MILLIMETER, SU_AUNIT_SQUARE_CENTIMETER,
 SU_AUNIT_SQUARE_METER, SU_AUNIT_SQUARE_YARD
 }
Indicates the different supported area string formatting units. More...
enum  | SUVolumeUnitType {
 SU_VUNIT_CUBIC_INCHES, SU_VUNIT_CUBIC_FEET, SU_VUNIT_CUBIC_MILLIMETER, SU_VUNIT_CUBIC_CENTIMETER,
 SU_VUNIT_CUBIC_METER, SU_VUNIT_CUBIC_YARD, SU_VUNIT_LITER, SU_VUNIT_US_GALLON
 }
Indicates the different supported volume string formatting units. More...
Detailed Description
Interfaces for SULengthFormatterRef.
Enumeration Type Documentation
 enum SUAreaUnitType
Indicates the different supported area string formatting units.
Since
SketchUp 2019.2, API 7.1
Added in SketchUp 2020, API 8.0
SU_AUNIT_SQUARE_YARD
Enumerator
SU_AUNIT_SQUARE_INCHES
SU_AUNIT_SQUARE_FEET
SU_AUNIT_SQUARE_MILLIMETER
SU_AUNIT_SQUARE_CENTIMETER
SU_AUNIT_SQUARE_METER
SU_AUNIT_SQUARE_YARD
 enum SULengthFormatType
Indicates the different supported length string formatting types.
Since
SketchUp 2018, API 6.0
Enumerator
SU_LFORMAT_DECIMAL
SU_LFORMAT_ARCHITECTURAL
SU_LFORMAT_ENGINEERING
SU_LFORMAT_FRACTIONAL
 enum SULengthUnitType
Indicates the different supported length string formatting units.
Since
SketchUp 2018, API 6.0
Added in SketchUp 2020, API 8.0
SU_LUNIT_YARD
Enumerator
SU_LUNIT_INCHES
SU_LUNIT_FEET
SU_LUNIT_MILLIMETER
SU_LUNIT_CENTIMETER
SU_LUNIT_METER
SU_LUNIT_YARD
 enum SUVolumeUnitType
Indicates the different supported volume string formatting units.
Since
SketchUp 2019.2, API 7.1
Added in SketchUp 2020, API 8.0
SU_VUNIT_CUBIC_YARD
SU_VUNIT_LITER
SU_VUNIT_US_GALLON
Enumerator
SU_VUNIT_CUBIC_INCHES
SU_VUNIT_CUBIC_FEET
SU_VUNIT_CUBIC_MILLIMETER
SU_VUNIT_CUBIC_CENTIMETER
SU_VUNIT_CUBIC_METER
SU_VUNIT_CUBIC_YARD
SU_VUNIT_LITER
SU_VUNIT_US_GALLON