Data Structures
overlay.h File Reference
An Overlay provides a way to render an image over the SU rendering. More...
#include <SketchUpAPI/model/defs.h>
 #include <SketchUpAPI/geometry.h>
Go to the source code of this file.
 Data Structures
struct  | SUBeginFrameInfo
Information about the frame camera and viewport that is passed to SUOverlayCreateInfo::begin_frame. More...
struct  | SUDrawFrameMemoryBuffer
Memory buffer (for color and depth) info used in SUOverlayDrawFrameInfo. More...
struct  | SUOverlayDrawFrameInfo
Data that SketchUp will use the to blend the given color/depth buffer onto SketchUp rendering. More...
struct  | SUOverlayCreateInfo
Arguments for creating an overlay object. More...
Detailed Description
An Overlay provides a way to render an image over the SU rendering.