Data Fields
SUDrawFrameMemoryBuffer Struct Reference
Memory buffer (for color and depth) info used in SUOverlayDrawFrameInfo. More...
#include <overlay.h>
 Data Fields
void *  | ptr
Pointer to the buffer. More...
uint32_t  | row_pitch
Size (in bytes) from the beginning of one line of the buffer to the next line. More...
uint32_t  | size
Total size (in bytes) of the buffer. More...
Detailed Description
Memory buffer (for color and depth) info used in SUOverlayDrawFrameInfo.
Field Documentation
 void* SUDrawFrameMemoryBuffer::ptr
Pointer to the buffer.
 uint32_t SUDrawFrameMemoryBuffer::row_pitch
Size (in bytes) from the beginning of one line of the buffer to the next line.
 uint32_t SUDrawFrameMemoryBuffer::size
Total size (in bytes) of the buffer.
 The documentation for this struct was generated from the following file:
SketchUpAPI/application/overlay.h